Центр_управления_производительностью_демо/src/Catalogs/СчетчикиПроизводительности/СчетчикиПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетчикиПроизводительности</name>
  <attributes>
    <name>КодСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НациональноеПредставление</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНациональное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Catalogs/СчетчикиПроизводительности/ObjectModule.bsl
Процедура ЗагрузитьШаблон(ШаблонЭлемента) Экспорт
	Если ШаблонЭлемента <> Неопределено Тогда
		ЭтотОбъект.Наименование = ШаблонЭлемента["Наименование"];
		ЭтотОбъект.Описание = ШаблонЭлемента["Описание"];
		
		ЭтотОбъект.НациональноеПредставление.Очистить();
		Для Каждого ТекЯзык Из ШаблонЭлемента["Языки"] Цикл
			НовСтрока = ЭтотОбъект.НациональноеПредставление.Добавить();
			НовСтрока.Язык = ТекЯзык.Ключ;
			НовСтрока.НаименованиеНациональное = ТекЯзык.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
